Repository: chidang/flex-quiz-lite
Catalog: languages/flex-quiz-*.po
Languages: fi

source: %s updated:
fi: %s päivitetty:

source: Add New %s
fi: Lisää uusi %s

source: All %s
fi: Kaikki %s

source: Answers breakdown
fi: Vastausten erittely

source: Are you sure you want to quit this exam?
fi: Haluatko varmasti keskeyttää tämän kokeen?

source: Comma-separated list of email addresses
fi: Pilkuilla eroteltu sähköpostiosoitteiden luettelo

source: Date of birth
fi: Syntymäaika

source: Date of Birth:
fi: Syntymäaika:

source: E-mail
fi: Sähköposti

source: Edit %s
fi: Muokkaa %s

source: Email
fi: Sähköposti

source: Email:
fi: Sähköposti:

source: Exam created successfully
fi: Koe luotu onnistuneesti

source: Exam data not found.
fi: Koetietoja ei löydy.

source: Exam not found
fi: Tenttiä ei löytynyt

source: Exam Participant
fi: Kokeen osallistuja

source: Exam Participants
fi: Kokeen osallistujat

source: Exam Submission
fi: Tentin lähettäminen

source: Exam Submissions
fi: Tenttilähetykset

source: Exam updated successfully
fi: Koe päivitetty onnistuneesti

source: Examination
fi: Tutkimus

source: Examination:
fi: Tutkimus:

source: Examinations
fi: Tutkimukset

source: Failed to check personal info
fi: Henkilötietojen tarkistaminen epäonnistui

source: Failed to create exam submission
fi: Koelähetyksen luominen epäonnistui

source: Finish
fi: Suorittaa loppuun

source: Full name
fi: Koko nimi

source: Full Name:
fi: Koko nimi:

source: Go Back
fi: Mene takaisin

source: Go to the exam page
fi: Siirry koesivulle

source: Good Luck on the Exam!
fi: Onnea kokeeseen!

source: Loading
fi: Ladataan

source: Name (First and Last name)
fi: Nimi (etu- ja sukunimi)

source: Next - Step
fi: Seuraava - Vaihe

source: No
fi: Ei

source: No answers submitted.
fi: Vastauksia ei lähetetty.

source: Notification Admin Emails
fi: Ilmoitusjärjestelmänvalvojan sähköpostit

source: Participant Details
fi: Osallistujan tiedot

source: Personal Information
fi: Henkilökohtaisia ​​tietoja

source: Please answer on %s questions below
fi: Vastaa %s kysymykseen alla

source: Please answer question
fi: Ole hyvä ja vastaa kysymykseen

source: Please enter your Name, Date of Birth and E-mail
fi: Kirjoita nimesi, syntymäaikasi ja sähköpostiosoitteesi

source: Please fill in all required personal information.
fi: Täytä kaikki vaaditut henkilötiedot.

source: Please provide a valid email address.
fi: Anna kelvollinen sähköpostiosoite.

source: Points
fi: Pisteet

source: Popular %s
fi: Suosittu %s

source: Quit Exam
fi: Lopeta koe

source: Results
fi: Tulokset

source: Something went wrong. Please contact the administrator for assistance.
fi: Jotain meni pieleen. Ota yhteyttä ylläpitäjään saadaksesi apua.

source: Start Again
fi: Aloittaa uudelleen

source: Step
fi: Vaihe

source: Submission at
fi: Lähetys klo

source: Submission Details
fi: Lähetyksen tiedot

source: Subscribe for newsletter
fi: Tilaa uutiskirje

source: Subscribe for newsletter:
fi: Tilaa uutiskirje:

source: The exam average is
fi: Tentin keskiarvo on

source: The exam average is:
fi: Tentin keskiarvo on:

source: Total points are:
fi: Pisteet yhteensä ovat:

source: Update %s
fi: Päivitä %s

source: Uploaded to this %s:
fi: Ladattu tähän %s:

source: User Information
fi: Käyttäjän tiedot

source: View %s
fi: Näytä %s

source: Yes
fi: Joo

source: You have already started this exam. This exam can only be done once.
fi: Olet jo aloittanut tämän kokeen. Tämä koe voidaan tehdä vain kerran.

source: Your points are
fi: Pisteesi ovat
